// Задача 21
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53


// Console.Write("Введите X1: ");
// int X1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите Y1: ");
// int Y1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите Z1: ");
// int Z1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите X2: ");
// int X2 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите Y2: ");
// int Y2 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите Z2: ");
// int Z2 = Convert.ToInt32(Console.ReadLine());

// double s = Math.Sqrt ((Math.Pow((X2-X1),2) + Math.Pow((Y2-Y1),2) + Math.Pow((Z2-Z1),2)));

// Console.WriteLine(s);

// Задача 23
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

// Console.Write("Введите число: ");
// int N = Convert.ToInt32(Console.ReadLine());

// for (int i = 1; i <= N; i++ )
// {
//     Console.WriteLine(Math.Pow(i,3));
// }


// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.Write("Введите пятизначное число: ");
int num = Convert.ToInt32(Console.ReadLine());

